In [1]:
import pandas as pd

# Practice problem VII

In [2]:
# load the occupation dataset
path= 'https://raw.githubusercontent.com/um-perez-alvaro/Data-Science-Practice/master/Data/users.csv'
df = pd.read_csv(path, index_col='user_id')
df

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

What is the mean age per occupation?

Calculate the number of male and female users per occupation.

For each occupation, calculate the minimum and maximum ages.

Hint: use pandas `agg()` method.

For each combination of occupation and gender, calculate the mean age.

Calculate the number of male and female users by occupation. Assign the result to a Series named `gender_occupation`.

- Hint: group by `occupation` and `gender`, and apply the method `count` to the `gender` column

Calculate the number of users by occupation. Assign the result to a Series named `total_occupation`.

- Hint: group by `occupation`, and apply the method `count` to the `gender` column.

Divide the Series `gender_occupation` by the Series `total_occupation` and multiply the result by 100. This will give you the percentage of male and female users by occupation.